src/Reports/ОтчётПоБракуПолуфабрикатовПолный/ОтчётПоБракуПолуфабрикатовПолный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчётПоБракуПолуфабрикатовПолный</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
</mdclass:Report>

src/Catalogs/Ремонт/Ремонт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Ремонт</name>
  <attributes>
    <name>ВидРемонта</name>
    <type>
      <types>EnumRef.ВидыРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>БарКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапВхода</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственноеЗадание</name>
    <type>
      <types>DocumentRef.ДвижениеМПЗ</types>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.ВыпускПродукцииКанбан</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратнаяТара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>СтандартныйКомментарий</name>
    <type>
      <types>CatalogRef.КомментарииНеисправностей</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийРемонтника</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтложен</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоНеремонтопригодных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЭлементыРемонта</name>
    <attributes>
      <name>НР</name>
      <type>
        <types>CatalogRef.АналогиНормРасходов</types>
        <types>CatalogRef.НормыРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Позиция</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Элемент</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидНеисправности</name>
      <type>
        <types>CatalogRef.ВидыНеисправностей</types>
      </type>
    </attributes>
    <attributes>
      <name>МТК</name>
      <type>
        <types>DocumentRef.МаршрутнаяКарта</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ДвижениеМПЗ</types>
        <types>DocumentRef.СписаниеМПЗПрочее</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаменаЭлемента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>БракПоставщика</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НовыйЭлемент</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
        <types>CatalogRef.АналогиНормРасходов</types>
        <types>CatalogRef.НормыРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсновнаяЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Виртуальный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНахожденияВБуфере</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПоМощности</name>
    <type>
      <types>CatalogRef.ГруппыПоМощности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСозданияСпецификации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерений</types>
    </type>
  </attributes>
  <attributes>
    <name>Канбан</name>
    <type>
      <types>CatalogRef.ВидыКанбанов</types>
    </type>
  </attributes>
  <attributes>
    <name>КолВКанбане</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КолКанбан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолнНаименование</name>
    <comment>Полное наименование, краткие характеристики</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Промывка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделПоЕСКД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловныеПриборы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловныйКоэффициентПЭО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблоныТО</name>
    <type>
      <types>CatalogRef.ШаблоныТехОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапПроизводства</name>
    <type>
      <types>CatalogRef.ЭтапыПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЖизненногоЦикла</name>
    <type>
      <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБрака</name>
    <type>
      <types>CatalogRef.ВидыБрака</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинОстаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПиковыеПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрещеноКОтгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтроля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПереходНаРедизайн</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПересмотра</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЛинииSMD</name>
    <attributes>
      <name>Линия</name>
      <type>
        <types>CatalogRef.ЛинииSMD</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЛинейкиSMD</name>
    <attributes>
      <name>Линейка</name>
      <type>
        <types>CatalogRef.Линейки</types>
      </type>
    </attributes>
    <attributes>
      <name>Основная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Reports/ОтчётПоБракуПолуфабрикатовПолный/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()

ТабДок.Очистить();
ТаблицаРемонта = Новый ТаблицаЗначений;

ТаблицаРемонта.Колонки.Добавить("КодРМ",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(2,0)));
ТаблицаРемонта.Колонки.Добавить("РабочееМесто",Новый ОписаниеТипов("СправочникСсылка.РабочиеМестаЛинеек"));
ТаблицаРемонта.Колонки.Добавить("Изделие",Новый ОписаниеТипов("Строка",Новый КвалификаторыСтроки(50)));
ТаблицаРемонта.Колонки.Добавить("ЭтапСпецификации",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
ТаблицаРемонта.Колонки.Добавить("БарКод",Новый ОписаниеТипов("Строка",Новый КвалификаторыСтроки(17)));
ТаблицаРемонта.Колонки.Добавить("Ремонт",Новый ОписаниеТипов("СправочникСсылка.Ремонт"));
ТаблицаРемонта.Колонки.Добавить("ВидНеисправности",Новый ОписаниеТипов("СправочникСсылка.ВидыНеисправностей"));
ТаблицаРемонта.Колонки.Добавить("Позиция",Новый ОписаниеТипов("Строка",Новый КвалификаторыСтроки(10)));
ТаблицаРемонта.Колонки.Добавить("Элемент",Новый ОписаниеТипов("Строка",Новый КвалификаторыСтроки(100)));
ТаблицаРемонта.Колонки.Добавить("СтандартныйКомментарий",Новый ОписаниеТипов("СправочникСсылка.КомментарииНеисправностей"));
ТаблицаРемонта.Колонки.Добавить("МестоВозникновенияБрака",Новый ОписаниеТипов("СправочникСсылка.ВидыНеисправностей"));

ТаблицаРемонтаКоды = Новый ТаблицаЗначений;

ТаблицаРемонтаКоды.Колонки.Добавить("Ремонт",Новый ОписаниеТипов("СправочникСсылка.Ремонт"));
ТаблицаРемонтаКоды.Колонки.Добавить("Отправлено",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(7,3)));
ТаблицаРемонтаКоды.Колонки.Добавить("Отремонтировано",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(7,3)));
ТаблицаРемонтаКоды.Колонки.Добавить("ВРемонтеНач",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(7,3)));

	Если ВидОтчёта = 8 Тогда
	Макет = Отчеты.ОтчётПоБракуПолуфабрикатовПолный.ПолучитьМакет("ДляВыгрузки");
	ОблШапка = Макет.ПолучитьОбласть("Шапка");
	ОблИзделие = Макет.ПолучитьОбласть("Изделие");
	Иначе	
		Если ВидОтчёта = 1 Тогда
		Макет = Отчеты.ОтчётПоБракуПолуфабрикатовПолный.ПолучитьМакет("ПоИзделиям");
		ОблИзделие = Макет.ПолучитьОбласть("Изделие");
		ОблИтогоИзделие = Макет.ПолучитьОбласть("ИтогоИзделие");
		ИначеЕсли ВидОтчёта = 2 Тогда
		Макет = Отчеты.ОтчётПоБракуПолуфабрикатовПолный.ПолучитьМакет("ПоРабочимМестам");
		ОблРМ = Макет.ПолучитьОбласть("РМ");
		ОблИтогоРМ = Макет.ПолучитьОбласть("ИтогоРМ");
		ИначеЕсли ВидОтчёта = 3 Тогда
		Макет = Отчеты.ОтчётПоБракуПолуфабрикатовПолный.ПолучитьМакет("ПоВидамНеисправностей");
		ОблВН = Макет.ПолучитьОбласть("ВН");
		ОблИтогоВН = Макет.ПолучитьОбласть("ИтогоВН");
		ИначеЕсли ВидОтчёта = 4 Тогда
		Макет = Отчеты.ОтчётПоБракуПолуфабрикатовПолный.ПолучитьМакет("ПоМестамВозникновенияБрака");
		ОблМестоВозникновенияБрака = Макет.ПолучитьОбласть("МестоВозникновенияБрака");
		ОблИтогоМестоВозникновенияБрака = Макет.ПолучитьОбласть("ИтогоМестоВозникновенияБрака");
		КонецЕсли;	
	ОблШапка = Макет.ПолучитьОбласть("Шапка");
	ОблКод = Макет.ПолучитьОбласть("Код");	
	ОблЭлементРемонта = Макет.ПолучитьОбласть("ЭлементРемонта");
	ОблКонец = Макет.ПолучитьОбласть("Конец");	
	КонецЕсли; 	
ОблШапка.Параметры.ДатаНач = Отчет.Период.ДатаНачала;
ОблШапка.Параметры.ДатаКон = Отчет.Период.ДатаОкончания;
ОблШапка.Параметры.ДатаВывода = ТекущаяДата();
ТабДок.Вывести(ОблШапка);

Запрос = Новый Запрос;
Запрос.Текст = 
	"ВЫБРАТЬ
	|	Ремонт.Ссылка,
	|	Ремонт.ДатаНачала,
	|	Ремонт.ДатаОкончания,
	|	Ремонт.ПроизводственноеЗадание,
	|	Ремонт.РабочееМесто,
	|	Ремонт.ЭтапВхода,
	|	Ремонт.БарКод,
	|	Ремонт.Изделие,
	|	Ремонт.СтандартныйКомментарий,
	|	Ремонт.Количество
	|ИЗ
	|	Справочник.Ремонт КАК Ремонт
	|ГДЕ
	|	Ремонт.ПометкаУдаления = ЛОЖЬ
	|	И Ремонт.ДатаНачала <= &ДатаКон";
	Если СписокЛинеек.Количество() > 0 Тогда
	Запрос.Текст = Запрос.Текст + " И Ремонт.Линейка В(&СписокЛинеек)";
	Запрос.УстановитьПараметр("СписокЛинеек",СписокЛинеек);
	КонецЕсли;
		Если ПодразделениеВыбраковщик.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + " И Ремонт.Линейка.Подразделение В(&СписокПодразделений)";
		Запрос.УстановитьПараметр("СписокПодразделений",ПодразделениеВыбраковщик);
		КонецЕсли;
			Если СписокГруппСпецификаций.Количество() > 0 Тогда
			Запрос.Текст = Запрос.Текст + " И Ремонт.ПроизводственноеЗадание.Изделие В ИЕРАРХИИ(&СписокГруппСпецификаций)";
			КонецЕсли;
				Если СписокВидовРемонта.Количество() > 0 Тогда
				Запрос.Текст = Запрос.Текст + " И Ремонт.ВидРемонта В(&СписокВидовРемонта)";
				КонецЕсли; 
					Если Не ОграничениеПоИзделию.Пустая() Тогда
					Запрос.Текст = Запрос.Текст + " И Ремонт.Изделие = &ОграничениеПоИзделию";
					КонецЕсли;  	
						Если Не ОграничениеПоРабочемуМесту.Пустая() Тогда
						Запрос.Текст = Запрос.Текст + " И Ремонт.РабочееМесто = &ОграничениеПоРабочемуМесту";
						КонецЕсли; 
							Если Не ОграничениеПоСтандартномуКомментарию.Пустая() Тогда
							Запрос.Текст = Запрос.Текст + " И Ремонт.СтандартныйКомментарий = &ОграничениеПоСтандартномуКомментарию";
							КонецЕсли; 
Запрос.УстановитьПараметр("СписокЛинеек",СписокЛинеек);
Запрос.УстановитьПараметр("ДатаКон",Отчет.Период.ДатаОкончания);
Запрос.УстановитьПараметр("СписокГруппСпецификаций",СписокГруппСпецификаций);
Запрос.УстановитьПараметр("СписокВидовРемонта",СписокВидовРемонта);
Запрос.УстановитьПараметр("ОграничениеПоИзделию",ОграничениеПоИзделию);
Запрос.УстановитьПараметр("ОграничениеПоРабочемуМесту",ОграничениеПоРабочемуМесту);
Запрос.УстановитьПараметр("ОграничениеПоСтандартномуКомментарию",ОграничениеПоСтандартномуКомментарию);
Результат = Запрос.Выполнить();
Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
	Отправлено = 0;
	Отремонтировано = 0;
	ВРемонтеНач = 0; 
		Если Выборка.ДатаНачала >= Отчет.Период.ДатаНачала Тогда
		Отправлено = ?(Выборка.Количество = 0,1,Выборка.Количество);			
		Иначе
		ВРемонтеНач = ?(Выборка.Количество = 0,1,Выборка.Количество);
		КонецЕсли;
			Если Выборка.ДатаОкончания <> Дата(1,1,1) Тогда
				Если Выборка.ДатаОкончания < Отчет.Период.ДатаНачала Тогда				
				Продолжить;
				КонецЕсли; 
					Если (Выборка.ДатаОкончания >= Отчет.Период.ДатаНачала)и(Выборка.ДатаОкончания <= Отчет.Период.ДатаОкончания) Тогда
					Отремонтировано = ?(Выборка.Количество = 0,1,Выборка.Количество);
					КонецЕсли;			
			КонецЕсли; 
	ТЧКоды = ТаблицаРемонтаКоды.Добавить();
	ТЧКоды.Ремонт = Выборка.Ссылка;
	ТЧКоды.Отправлено = Отправлено;
	ТЧКоды.Отремонтировано = Отремонтировано;
	ТЧКоды.ВРемонтеНач = ВРемонтеНач;
		Если Выборка.Ссылка.ЭлементыРемонта.Количество() > 0 Тогда
			Для каждого ЭлементРемонта Из Выборка.Ссылка.ЭлементыРемонта Цикл
				Если ЭлементРемонта.ВидНеисправности.НеПоказыватьВОтчётахПоРемонту Тогда
				Продолжить;
				КонецЕсли; 
					Если Не ОграничениеПоВидуНеисправности.Пустая() Тогда
						Если ЭлементРемонта.ВидНеисправности <> ОграничениеПоВидуНеисправности Тогда
						Продолжить;
						КонецЕсли;
					КонецЕсли; 
						Если Не ОграничениеПоРемонтируемомуПФ.Пустая() Тогда
							Если ЭлементРемонта.Спецификация <> ОграничениеПоРемонтируемомуПФ Тогда
							Продолжить;
							КонецЕсли;
						КонецЕсли;
							Если ОграничениеПоНеисправномуЭлементу <> Неопределено Тогда
								Если ЭлементРемонта.Элемент <> ОграничениеПоНеисправномуЭлементу Тогда
								Продолжить;
								КонецЕсли;
							КонецЕсли;
								Если Не ОграничениеПоМестуВозникновенияБрака.Пустая() Тогда
									Если ЭлементРемонта.ВидНеисправности.Родитель <> ОграничениеПоМестуВозникновенияБрака Тогда
									Продолжить;
									КонецЕсли;
								КонецЕсли;
									Если Не ГруппаВидовНеисправностей.Пустая() Тогда
										Если ЭлементРемонта.ВидНеисправности.Родитель <> ГруппаВидовНеисправностей Тогда
										Продолжить;
										КонецЕсли; 
									КонецЕсли;	
			ТЧ = ТаблицаРемонта.Добавить();
			ТЧ.КодРМ = Выборка.РабочееМесто.Код;
			ТЧ.РабочееМесто = Выборка.РабочееМесто;
				Если Выборка.ПроизводственноеЗадание.Пустая() Тогда
				ТЧ.Изделие = СокрЛП(Выборка.Ссылка.Наименование);
				Иначе
				ТЧ.Изделие = СокрЛП(Выборка.ПроизводственноеЗадание.Изделие.Наименование);
				КонецЕсли; 
			ТЧ.ЭтапСпецификации = ЭлементРемонта.Спецификация;
			ТЧ.БарКод = Выборка.БарКод;
			ТЧ.Ремонт = Выборка.Ссылка;
			ТЧ.ВидНеисправности = ЭлементРемонта.ВидНеисправности;
			ТЧ.Позиция = ЭлементРемонта.Позиция;
			ТЧ.Элемент = ЭлементРемонта.Элемент.Наименование;		
			ТЧ.СтандартныйКомментарий = Выборка.СтандартныйКомментарий;
			ТЧ.МестоВозникновенияБрака = ЭлементРемонта.ВидНеисправности.Родитель;		
			КонецЦикла;
		Иначе
			Если Не ОграничениеПоВидуНеисправности.Пустая() Тогда
			Продолжить;
			КонецЕсли; 
				Если Не ОграничениеПоРемонтируемомуПФ.Пустая() Тогда
				Продолжить;
				КонецЕсли;
					Если ОграничениеПоНеисправномуЭлементу <> Неопределено Тогда
					Продолжить;
					КонецЕсли;
						Если Не ОграничениеПоМестуВозникновенияБрака.Пустая() Тогда
						Продолжить;
						КонецЕсли;
		ТЧ = ТаблицаРемонта.Добавить();
		ТЧ.КодРМ = Выборка.РабочееМесто.Код;
		ТЧ.РабочееМесто = Выборка.РабочееМесто;
		ТЧ.Изделие = Выборка.ПроизводственноеЗадание.Изделие;
			Если Выборка.ПроизводственноеЗадание.Пустая() Тогда
			ТЧ.Изделие = СокрЛП(Выборка.Ссылка.Наименование);
			Иначе
			ТЧ.Изделие = СокрЛП(Выборка.ПроизводственноеЗадание.Изделие.Наименование);
			КонецЕсли; 
		ТЧ.БарКод = Выборка.БарКод;
		ТЧ.Ремонт = Выборка.Ссылка;
		ТЧ.СтандартныйКомментарий = Выборка.СтандартныйКомментарий;
		КонецЕсли;  
	КонецЦикла;
		Если (ВидОтчёта = 1)или(ВидОтчёта = 8) Тогда
		ТаблицаРемонта.Сортировать("Изделие,БарКод,Ремонт,ЭтапСпецификации,Позиция");
		ИначеЕсли ВидОтчёта = 2 Тогда
		ТаблицаРемонта.Сортировать("КодРМ,РабочееМесто,БарКод,Ремонт,ЭтапСпецификации,Позиция");		
		ТекРМ = Справочники.РабочиеМестаЛинеек.ПустаяСсылка();
		ИначеЕсли ВидОтчёта = 3 Тогда
		ТаблицаРемонта.Сортировать("ВидНеисправности,БарКод,Ремонт,ЭтапСпецификации,Позиция");		
		ТекВН = Справочники.ВидыНеисправностей.ПустаяСсылка();
		ИначеЕсли ВидОтчёта = 4 Тогда
		ТаблицаРемонта.Сортировать("ЭтапСпецификации,БарКод,Ремонт,Позиция");		
		ТекПФ = Справочники.Номенклатура.ПустаяСсылка();
		ИначеЕсли ВидОтчёта = 5 Тогда
		ТаблицаРемонта.Сортировать("Элемент,БарКод,Ремонт,Позиция");		
		ТекЭлемент = "";
		ИначеЕсли ВидОтчёта = 6 Тогда
		ТаблицаРемонта.Сортировать("СтандартныйКомментарий,БарКод,Ремонт,Позиция");		
		ТекСтандартныйКомментарий = "";
		ИначеЕсли ВидОтчёта = 7 Тогда
		ТаблицаРемонта.Сортировать("МестоВозникновенияБрака,БарКод,Ремонт,Позиция");		
		ТекМестоВозникновенияБрака = Справочники.ВидыНеисправностей.ПустаяСсылка();
		КонецЕсли; 
КолНачИтого = 0;
КолПрихИтого = 0;
КолРасхИтого = 0;
КолКонИтого = 0;
КолНачВсего = 0;
КолПрихВсего = 0;
КолРасхВсего = 0;
КолКонВсего = 0;
ТекИзделие = "";
ТекРемонт = Справочники.Ремонт.ПустаяСсылка();
	Для каждого ТЧ Из ТаблицаРемонта Цикл
		Если ВидОтчёта = 1 Тогда
			Если ТЧ.Изделие <> ТекИзделие Тогда
				Если ЗначениеЗаполнено(ТекИзделие) Тогда
				ОблИтогоИзделие.Параметры.КолНачИтого = КолНачИтого;
				ОблИтогоИзделие.Параметры.КолПрихИтого = КолПрихИтого;
				ОблИтогоИзделие.Параметры.КолРасхИтого = КолРасхИтого;
				ОблИтогоИзделие.Параметры.КолКонИтого = КолКонИтого;
				ТабДок.Вывести(ОблИтогоИзделие);	
				КонецЕсли;
			ОблИзделие.Параметры.Изделие = ТЧ.Изделие;
			ТабДок.Вывести(ОблИзделие);
			ТекИзделие = ТЧ.Изделие;
			ТекБарКод = "";
			КолНачИтого = 0;
			КолПрихИтого = 0;
			КолРасхИтого = 0;
			КолКонИтого = 0;				
			КонецЕсли;
		ИначеЕсли ВидОтчёта = 2 Тогда			
			Если ТЧ.РабочееМесто <> ТекРМ Тогда
				Если Не ТекРМ.Пустая() Тогда
				ОблИтогоРМ.Параметры.КолНачИтого = КолНачИтого;
				ОблИтогоРМ.Параметры.КолПрихИтого = КолПрихИтого;
				ОблИтогоРМ.Параметры.КолРасхИтого = КолРасхИтого;
				ОблИтогоРМ.Параметры.КолКонИтого = КолКонИтого;
				ТабДок.Вывести(ОблИтогоРМ);	
				КонецЕсли;
			ОблРМ.Параметры.РабочееМесто = ТЧ.РабочееМесто;
			ТабДок.Вывести(ОблРМ);
			ТекРМ = ТЧ.РабочееМесто;
			ТекБарКод = "";
			КолНачИтого = 0;
			КолПрихИтого = 0;
			КолРасхИтого = 0;
			КолКонИтого = 0;				
			КонецЕсли;
		ИначеЕсли ВидОтчёта = 3 Тогда			
			Если ТЧ.ВидНеисправности <> ТекВН Тогда
				Если Не ТекВН.Пустая() Тогда
				ОблИтогоВН.Параметры.КолНачИтого = КолНачИтого;
				ОблИтогоВН.Параметры.КолПрихИтого = КолПрихИтого;
				ОблИтогоВН.Параметры.КолРасхИтого = КолРасхИтого;
				ОблИтогоВН.Параметры.КолКонИтого = КолКонИтого;
				ТабДок.Вывести(ОблИтогоВН);	
				КонецЕсли;
			ОблВН.Параметры.ВидНеисправности = ТЧ.ВидНеисправности;
			ТабДок.Вывести(ОблВН);
			ТекВН = ТЧ.ВидНеисправности;
			ТекБарКод = "";
			КолНачИтого = 0;
			КолПрихИтого = 0;
			КолРасхИтого = 0;
			КолКонИтого = 0;				
			КонецЕсли;
		ИначеЕсли ВидОтчёта = 4 Тогда			
			Если ТЧ.ЭтапСпецификации <> ТекПФ Тогда
				Если Не ТекПФ.Пустая() Тогда
				ОблИтогоПФ.Параметры.КолНачИтого = КолНачИтого;
				ОблИтогоПФ.Параметры.КолПрихИтого = КолПрихИтого;
				ОблИтогоПФ.Параметры.КолРасхИтого = КолРасхИтого;
				ОблИтогоПФ.Параметры.КолКонИтого = КолКонИтого;
				ТабДок.Вывести(ОблИтогоПФ);	
				КонецЕсли;
			ОблПФ.Параметры.ЭтапСпецификации = ТЧ.ЭтапСпецификации;
			ТабДок.Вывести(ОблПФ);
			ТекПФ = ТЧ.ЭтапСпецификации;
			ТекБарКод = "";
			КолНачИтого = 0;
			КолПрихИтого = 0;
			КолРасхИтого = 0;
			КолКонИтого = 0;				
			КонецЕсли;
		ИначеЕсли ВидОтчёта = 5 Тогда			
			Если ТЧ.Элемент <> ТекЭлемент Тогда
				Если ТекЭлемент <> "" Тогда
				ОблИтогоЭлемент.Параметры.КолНачИтого = КолНачИтого;
				ОблИтогоЭлемент.Параметры.КолПрихИтого = КолПрихИтого;
				ОблИтогоЭлемент.Параметры.КолРасхИтого = КолРасхИтого;
				ОблИтогоЭлемент.Параметры.КолКонИтого = КолКонИтого;
				ТабДок.Вывести(ОблИтогоЭлемент);	
				КонецЕсли;
			ОблЭлемент.Параметры.Элемент = ТЧ.Элемент;
			ТабДок.Вывести(ОблЭлемент);
			ТекЭлемент = ТЧ.Элемент;
			ТекБарКод = "";
			КолНачИтого = 0;
			КолПрихИтого = 0;
			КолРасхИтого = 0;
			КолКонИтого = 0;				
			КонецЕсли;
		ИначеЕсли ВидОтчёта = 6 Тогда			
			Если ТЧ.СтандартныйКомментарий <> ТекСтандартныйКомментарий Тогда
				Если ТекСтандартныйКомментарий <> "" Тогда
				ОблИтогоСтандартныйКомментарий.Параметры.КолНачИтого = КолНачИтого;
				ОблИтогоСтандартныйКомментарий.Параметры.КолПрихИтого = КолПрихИтого;
				ОблИтогоСтандартныйКомментарий.Параметры.КолРасхИтого = КолРасхИтого;
				ОблИтогоСтандартныйКомментарий.Параметры.КолКонИтого = КолКонИтого;
				ТабДок.Вывести(ОблИтогоСтандартныйКомментарий);	
				КонецЕсли;
			ОблСтандартныйКомментарий.Параметры.СтандартныйКомментарий = ТЧ.СтандартныйКомментарий;
			ТабДок.Вывести(ОблСтандартныйКомментарий);
			ТекСтандартныйКомментарий = ТЧ.СтандартныйКомментарий;
			ТекБарКод = "";
			КолНачИтого = 0;
			КолПрихИтого = 0;
			КолРасхИтого = 0;
			КолКонИтого = 0;				
			КонецЕсли;
		ИначеЕсли ВидОтчёта = 7 Тогда			
			Если ТЧ.МестоВозникновенияБрака <> ТекМестоВозникновенияБрака Тогда
				Если Не ТекМестоВозникновенияБрака.Пустая() Тогда
				ОблИтогоМестоВозникновенияБрака.Параметры.КолНачИтого = КолНачИтого;
				ОблИтогоМестоВозникновенияБрака.Параметры.КолПрихИтого = КолПрихИтого;
				ОблИтогоМестоВозникновенияБрака.Параметры.КолРасхИтого = КолРасхИтого;
				ОблИтогоМестоВозникновенияБрака.Параметры.КолКонИтого = КолКонИтого;
				ТабДок.Вывести(ОблИтогоМестоВозникновенияБрака);	
				КонецЕсли;
			ОблМестоВозникновенияБрака.Параметры.МестоВозникновенияБрака = ТЧ.МестоВозникновенияБрака;
			ТабДок.Вывести(ОблМестоВозникновенияБрака);
			ТекМестоВозникновенияБрака = ТЧ.МестоВозникновенияБрака;
			ТекБарКод = "";
			КолНачИтого = 0;
			КолПрихИтого = 0;
			КолРасхИтого = 0;
			КолКонИтого = 0;				
			КонецЕсли;			
		ИначеЕсли ВидОтчёта = 8 Тогда
		ОблИзделие.Параметры.Заполнить(ТЧ);
		ОблИзделие.Параметры.СтандартныйКомментарий = ТЧ.Ремонт.СтандартныйКомментарий;
		ОблИзделие.Параметры.Комментарий = ТЧ.Ремонт.Комментарий;
		ОблИзделие.Параметры.КомментарийРемонтника = ТЧ.Ремонт.КомментарийРемонтника;
		ВыбЗнач = ТаблицаРемонтаКоды.Найти(ТЧ.Ремонт,"Ремонт");
			Если ВыбЗнач <> Неопределено Тогда
			КолНач = ВыбЗнач.ВРемонтеНач;
			КолПрих = ВыбЗнач.Отправлено;
			КолРасх = ВыбЗнач.Отремонтировано;
			КолКон = КолНач + КолПрих - КолРасх;		
			ОблИзделие.Параметры.КолНач = КолНач;
			ОблИзделие.Параметры.КолПрих = КолПрих;
			ОблИзделие.Параметры.КолРасх = КолРасх;
			ОблИзделие.Параметры.КолКон = КолКон;
			Иначе
			ОблИзделие.Параметры.КолНач = 0;
			ОблИзделие.Параметры.КолПрих = 0;
			ОблИзделие.Параметры.КолРасх = 0;
			ОблИзделие.Параметры.КолКон = 0;						
			КонецЕсли;
				Если ТЧ.Ремонт.ДатаНачала <> Дата(1,1,1) Тогда
				ОблИзделие.Параметры.Период = ""+ТЧ.Ремонт.ДатаНачала+" - ";				
				КонецЕсли;  
					Если ТЧ.Ремонт.ДатаОкончания <> Дата(1,1,1) Тогда
					ОблИзделие.Параметры.Период = ОблИзделие.Параметры.Период+ТЧ.Ремонт.ДатаОкончания;
					КонецЕсли; 
		ТабДок.Вывести(ОблИзделие);
		Продолжить;
		КонецЕсли; 
			Если ТЧ.Ремонт <> ТекРемонт Тогда
			ОблКод.Параметры.Заполнить(ТЧ);
			ОблКод.Параметры.Комментарий = СокрЛП(ТЧ.Ремонт.СтандартныйКомментарий.Наименование) + " (" + СокрЛП(ТЧ.Ремонт.Комментарий) + ")";
			ОблКод.Параметры.КомментарийРемонтника = ТЧ.Ремонт.КомментарийРемонтника;
			ВыбЗнач = ТаблицаРемонтаКоды.Найти(ТЧ.Ремонт,"Ремонт");
				Если ВыбЗнач <> Неопределено Тогда
				КолНач = ВыбЗнач.ВРемонтеНач;
				КолПрих = ВыбЗнач.Отправлено;
				КолРасх = ВыбЗнач.Отремонтировано;
				КолКон = КолНач + КолПрих - КолРасх;
				КолНачИтого = КолНачИтого + КолНач;
				КолПрихИтого = КолПрихИтого + КолПрих;
				КолРасхИтого = КолРасхИтого + КолРасх;
				КолКонИтого = КолКонИтого + КолКон;	
				КолНачВсего = КолНачВсего + КолНач;
				КолПрихВсего = КолПрихВсего + КолПрих;
				КолРасхВсего = КолРасхВсего + КолРасх;
				КолКонВсего = КолКонВсего + КолКон;	
				ОблКод.Параметры.КолНач = КолНач;
				ОблКод.Параметры.КолПрих = КолПрих;
				ОблКод.Параметры.КолРасх = КолРасх;
				ОблКод.Параметры.КолКон = КолКон;						
				КонецЕсли; 
					Если ТЧ.Ремонт.ДатаНачала <> Дата(1,1,1) Тогда
					ОблКод.Параметры.Период = ""+ТЧ.Ремонт.ДатаНачала+" - ";				
					КонецЕсли;  
						Если ТЧ.Ремонт.ДатаОкончания <> Дата(1,1,1) Тогда
						ОблКод.Параметры.Период = ОблКод.Параметры.Период+ТЧ.Ремонт.ДатаОкончания;
						КонецЕсли;								
			ТабДок.Вывести(ОблКод);
			ТекРемонт = ТЧ.Ремонт;
			КонецЕсли;	
	ОблЭлементРемонта.Параметры.Заполнить(ТЧ);		
	ТабДок.Вывести(ОблЭлементРемонта);			
	КонецЦикла;
		Если ВидОтчёта = 1 Тогда
		ОблИтогоИзделие.Параметры.КолНачИтого = КолНачИтого;
		ОблИтогоИзделие.Параметры.КолПрихИтого = КолПрихИтого;
		ОблИтогоИзделие.Параметры.КолРасхИтого = КолРасхИтого;
		ОблИтогоИзделие.Параметры.КолКонИтого = КолКонИтого;
		ТабДок.Вывести(ОблИтогоИзделие);
		ИначеЕсли ВидОтчёта = 2 Тогда
		ОблИтогоРМ.Параметры.КолНачИтого = КолНачИтого;
		ОблИтогоРМ.Параметры.КолПрихИтого = КолПрихИтого;
		ОблИтогоРМ.Параметры.КолРасхИтого = КолРасхИтого;
		ОблИтогоРМ.Параметры.КолКонИтого = КолКонИтого;
		ТабДок.Вывести(ОблИтогоРМ);	
		ИначеЕсли ВидОтчёта = 3 Тогда
		ОблИтогоВН.Параметры.КолНачИтого = КолНачИтого;
		ОблИтогоВН.Параметры.КолПрихИтого = КолПрихИтого;
		ОблИтогоВН.Параметры.КолРасхИтого = КолРасхИтого;
		ОблИтогоВН.Параметры.КолКонИтого = КолКонИтого;
		ТабДок.Вывести(ОблИтогоВН);
		ИначеЕсли ВидОтчёта = 4 Тогда
		ОблИтогоПФ.Параметры.КолНачИтого = КолНачИтого;
		ОблИтогоПФ.Параметры.КолПрихИтого = КолПрихИтого;
		ОблИтогоПФ.Параметры.КолРасхИтого = КолРасхИтого;
		ОблИтогоПФ.Параметры.КолКонИтого = КолКонИтого;
		ТабДок.Вывести(ОблИтогоПФ);
		ИначеЕсли ВидОтчёта = 5 Тогда
		ОблИтогоЭлемент.Параметры.КолНачИтого = КолНачИтого;
		ОблИтогоЭлемент.Параметры.КолПрихИтого = КолПрихИтого;
		ОблИтогоЭлемент.Параметры.КолРасхИтого = КолРасхИтого;
		ОблИтогоЭлемент.Параметры.КолКонИтого = КолКонИтого;
		ТабДок.Вывести(ОблИтогоЭлемент);
		ИначеЕсли ВидОтчёта = 6 Тогда
		ОблИтогоСтандартныйКомментарий.Параметры.КолНачИтого = КолНачИтого;
		ОблИтогоСтандартныйКомментарий.Параметры.КолПрихИтого = КолПрихИтого;
		ОблИтогоСтандартныйКомментарий.Параметры.КолРасхИтого = КолРасхИтого;
		ОблИтогоСтандартныйКомментарий.Параметры.КолКонИтого = КолКонИтого;
		ТабДок.Вывести(ОблИтогоСтандартныйКомментарий);
		ИначеЕсли ВидОтчёта = 6 Тогда
		ОблИтогоМестоВозникновенияБрака.Параметры.КолНачИтого = КолНачИтого;
		ОблИтогоМестоВозникновенияБрака.Параметры.КолПрихИтого = КолПрихИтого;
		ОблИтогоМестоВозникновенияБрака.Параметры.КолРасхИтого = КолРасхИтого;
		ОблИтогоМестоВозникновенияБрака.Параметры.КолКонИтого = КолКонИтого;
		ТабДок.Вывести(ОблИтогоМестоВозникновенияБрака);
		КонецЕсли;
			Если ВидОтчёта <> 8 Тогда
			ОблКонец.Параметры.КолНачВсего = КолНачВсего;
			ОблКонец.Параметры.КолПрихВсего = КолПрихВсего;
			ОблКонец.Параметры.КолРасхВсего = КолРасхВсего;
			ОблКонец.Параметры.КолКонВсего = КолКонВсего;
			ТабДок.Вывести(ОблКонец);
			КонецЕсли; 
ТабДок.ФиксацияСверху = 3;	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЭтаФорма.Параметры.Свойство("ВидОтчёта") Тогда
	Отчет.Период = ЭтаФорма.Параметры.Период;
	СписокЛинеек = ЭтаФорма.Параметры.Линейки;
	ПодразделениеВыбраковщик = ЭтаФорма.Параметры.Подразделения;
	ВидОтчёта = ЭтаФорма.Параметры.ВидОтчёта;
	СписокГруппСпецификаций = ЭтаФорма.Параметры.ГруппыПродукции;
	СписокВидовРемонта = ЭтаФорма.Параметры.ВидыРемонта;
	ГруппаВидовНеисправностей = ЭтаФорма.Параметры.МестоВозникновенияБрака;
		Если ВидОтчёта = 1 Тогда
		ОграничениеПоИзделию = ЭтаФорма.Параметры.Расшифровка;
		ИначеЕсли ВидОтчёта = 2 Тогда
		ОграничениеПоРабочемуМесту = ЭтаФорма.Параметры.Расшифровка;
		ИначеЕсли ВидОтчёта = 3 Тогда
		ОграничениеПоВидуНеисправности = ЭтаФорма.Параметры.Расшифровка;
		ИначеЕсли ВидОтчёта = 4 Тогда
		ОграничениеПоРемонтируемомуПФ = ЭтаФорма.Параметры.Расшифровка;
		ИначеЕсли ВидОтчёта = 5 Тогда
		ОграничениеПоНеисправномуЭлементу = ЭтаФорма.Параметры.Расшифровка;
		ИначеЕсли ВидОтчёта = 6 Тогда
		ОграничениеПоСтандартномуКомментарию = ЭтаФорма.Параметры.Расшифровка;
		ИначеЕсли ВидОтчёта = 7 Тогда
		ОграничениеПоМестуВозникновенияБрака = ЭтаФорма.Параметры.Расшифровка;
		КонецЕсли; 	
	СформироватьНаСервере();
	Иначе
	Отчет.Период.ДатаНачала = НачалоМесяца(ТекущаяДата());
	Отчет.Период.ДатаОкончания = ТекущаяДата();
	ВидОтчёта = 1;
	КонецЕсли; 
КонецПроцедуры
